---
kind: property
id: P:Autodesk.Revit.DB.OrdinateDimensionSetting.DimensionLineStyle
source: html/9a8ae63c-f2fd-8e48-3551-ac7d79139029.htm
---
# Autodesk.Revit.DB.OrdinateDimensionSetting.DimensionLineStyle Property

Specifies the dimension line style.

## Syntax (C#)
```csharp
public OrdinateDimensionLineStyle DimensionLineStyle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration